#+options: H:2
#+latex_class: beamer
#+columns: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+beamer_theme: Warsaw
#+beamer_color_theme:
#+beamer_font_theme:
#+beamer_inner_theme:
#+beamer_outer_theme:
#+beamer_header:

#+title: Configuración Emacs para Java y Python
#+date: <2024-06-11 Tue>
#+author: Lenin G. Falconí
#+email: lenin.falconi@epn.edu.ec
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.3)


** Configuración Interprete de Java 
- Buscar repositorios de OpenJDK para Ubuntu:
#+begin_src shell
sudo apt-cache search openjdk
#+end_src
- Seleccionar el repositorio e instalar:
#+begin_src shell
sudo apt install openjdk-21-jdk -y
#+end_src

- Configurar el entorno de variables añadiendo la ubicación del
  JDK.
- La ubicación de los bin/java se obtiene de ejecutar:

#+begin_src sh 
sudo update-alternatives --config java
#+end_src
- Configure las  variables de entorno

#+begin_src 
export JAVA_HOME="/usr/lib/jvm/java-17-openjdk-amd64"
#+end_src
- Actualice el terminal
#+begin_src sh
source /etc/profile
#+end_src
- Verifique la versión de java y javac
#+begin_src sh
java --version
javac --version
#+end_src

#+RESULTS:
| openjdk |  21.0.3 | 2024-04-16  |        |                                  |                                  |       |       |          |
| OpenJDK | Runtime | Environment | (build | 21.0.3+9-Ubuntu-1ubuntu122.04.1) |                                  |       |       |          |
| OpenJDK |  64-Bit | Server      | VM     | (build                           | 21.0.3+9-Ubuntu-1ubuntu122.04.1, | mixed | mode, | sharing) |
| javac   |  21.0.3 |             |        |                                  |                                  |       |       |          |

** Prueba código java

#+begin_src java :classname HelloWorld :var x='a'

public class HelloWorld{
    public static void main(String[] args){
	String userName="Johan S. Bach";
	System.out.println("Hello World "+userName);

    }
}

#+end_src

#+RESULTS:
 Hello World Johan S. Bach
    
